eis-cart-tests-master@3bc714a7387/tests/test-data/intf-specs/gswf/template/EIS_BBPerSecurity/request.xmlt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:even="http://www.thegoldensource.com/EventRaiserService.wsdl">
    <soapenv:Header/>
    <soapenv:Body>
        <even:RaiseEIS_BBPerSecurityAsynchron>
            <even:BBDownloadDirectory>${BB_DOWNLOAD_DIR!}</even:BBDownloadDirectory>
            <even:BBTimeout>3000</even:BBTimeout>
            <even:BBUploadDirectory>${BB_UPLOAD_DIR!}</even:BBUploadDirectory>
            <even:FileSystem>${FILE_SYSTEM!}</even:FileSystem>
            <even:FirmName>${FIRM_NAME!}</even:FirmName>
            <even:GroupName>${GROUP_NAME!}</even:GroupName>
            <even:MaxRequestsPerFile>5000</even:MaxRequestsPerFile>
            <even:MaxRetryTime>5000</even:MaxRetryTime>
            <even:NoOfFilesToRunInParallel>100</even:NoOfFilesToRunInParallel>
            <even:PricePointEventDefinitionId>${PRICE_POINT_DEF_ID!}</even:PricePointEventDefinitionId>
            <even:RequestType>${REQUEST_TYPE!}</even:RequestType>
            <even:RequestorID>UNKNOWN</even:RequestorID>
            <even:SN>${SN!}</even:SN>
            <even:StoreRequestFileLocalDirectory>${STORE_REQUEST_FILE_LOCAL_DIR!}</even:StoreRequestFileLocalDirectory>
            <even:StoreRequestFileonLocal>false</even:StoreRequestFileonLocal>
            <even:UserNumber>${USER_NUMBER!}</even:UserNumber>
            <even:WorkStation>${WORK_STATION!}</even:WorkStation>
        </even:RaiseEIS_BBPerSecurityAsynchron>
    </soapenv:Body>
</soapenv:Envelope>